## Diccionarios

Permite establecer una relación entre la información y sus claves (o llaves), lo cual permite un acceso directo.

In [7]:
informacion = {100:('Laura','Contaduria',2), 120:('Juan','Finanzas',5), 
               130:('Xime','Finanzas', 4), 125:('Rodrigo','Act', 2)}

In [2]:
informacion.values()

dict_values([('Juan', 'Finanzas', 5), ('Xime', 'Finanzas', 4), ('Rodrigo', 'Act', 2)])

In [3]:
informacion.items()

dict_items([(100, ('Laura', 'Contaduria', 2)), (120, ('Juan', 'Finanzas', 5)), (130, ('Xime', 'Finanzas', 4)), (125, ('Rodrigo', 'Act', 2))])

In [4]:
informacion.keys()

dict_keys([100, 120, 130, 125])

In [3]:
informacion.get(109)

In [8]:
informacion.update({109:("Xime","Finansas",5)})
informacion.items()

dict_items([(100, ('Laura', 'Contaduria', 2)), (120, ('Juan', 'Finanzas', 5)), (130, ('Xime', 'Finanzas', 4)), (125, ('Rodrigo', 'Act', 2)), (109, ('Xime', 'Finansas', 5))])

In [14]:
{type(x) for x in informacion.items()}

{tuple}

In [7]:
{(x[0], x[1][2]) for x in informacion.items()}

{(100, 2), (120, 5), (125, 2), (130, 5)}

In [8]:
{x[1][1] for x in informacion.items()}

{'Act', 'Contaduria', 'Finansas', 'Finanzas'}

Si se tiene información de varios tipos, se puede utilizar un diccionario

In [17]:
alumno1= {'clave':100, 'nombre':'Carolina', 'carrera':'RI', 'edad': 20}
alumno1.items()

dict_items([('clave', 100), ('nombre', 'Carolina'), ('carrera', 'RI'), ('edad', 20)])

In [10]:
alumno1.keys()

dict_keys(['clave', 'nombre', 'carrera', 'edad'])

In [11]:
alumno1.values()

dict_values([100, 'Carolina', 'RI', 20])

In [18]:
alumno1['carrera']='Economia'

alumno1.items()

dict_items([('clave', 100), ('nombre', 'Carolina'), ('carrera', 'Economia'), ('edad', 20)])

También se pueden construir tablas con los diccionarios.

In [22]:
dato1 =('Sandy','Diego','Laura')
dato2 = (18, 20, 18)
dato3 = ('Eco', 'Conta', 'Eco')
tabla = {'nombre':dato1, 'edad':dato2, 'carrera': dato3}
print(tabla)

{'nombre': ('Sandy', 'Diego', 'Laura'), 'edad': (18, 20, 18), 'carrera': ('Eco', 'Conta', 'Eco')}

In [31]:
print(tabla["nombre"][0]) 
print(tabla["carrera"][0])
print(tabla["edad"][0])

Sandy
Eco
18

In [14]:
tabla.items()

dict_items([('nombre', ('Sandy', 'Diego', 'Laura')), ('edad', (18, 20, 18)), ('carrera', ('Eco', 'Conta', 'Eco'))])

In [32]:
tabla['nombre'][0], tabla['edad'][0], tabla['carrera'][0]

('Sandy', 18, 'Eco')

In [16]:
tabla.keys()

dict_keys(['nombre', 'edad', 'carrera'])

In [17]:
dicc={'nombre':('Hugo','Paco','Luis','Ximena','Ari'),
      'edad':(18,16,18,23,19),
      'carrera':('Mate','Finanzas','Eco','Act','Act y Mate'),
      'semestre':(2,2,1,4,3)}

In [18]:
print(dicc)

{'nombre': ('Hugo', 'Paco', 'Luis', 'Ximena', 'Ari'), 'edad': (18, 16, 18, 23, 19), 'carrera': ('Mate', 'Finanzas', 'Eco', 'Act', 'Act y Mate'), 'semestre': (2, 2, 1, 4, 3)}

In [19]:
dicc.items()

dict_items([('nombre', ('Hugo', 'Paco', 'Luis', 'Ximena', 'Ari')), ('edad', (18, 16, 18, 23, 19)), ('carrera', ('Mate', 'Finanzas', 'Eco', 'Act', 'Act y Mate')), ('semestre', (2, 2, 1, 4, 3))])

In [20]:
dicc.values()

dict_values([('Hugo', 'Paco', 'Luis', 'Ximena', 'Ari'), (18, 16, 18, 23, 19), ('Mate', 'Finanzas', 'Eco', 'Act', 'Act y Mate'), (2, 2, 1, 4, 3)])

In [21]:
dicc.keys()

dict_keys(['nombre', 'edad', 'carrera', 'semestre'])

In [22]:
dicc['carrera'][0]

'Mate'

In [23]:
prueba= [i for i in dicc]   # muestra el nombre de las llaves
print(prueba)

['nombre', 'edad', 'carrera', 'semestre']

In [24]:
print([dicc[i] for i in dicc])  # muestra la informacion

[('Hugo', 'Paco', 'Luis', 'Ximena', 'Ari'), (18, 16, 18, 23, 19), ('Mate', 'Finanzas', 'Eco', 'Act', 'Act y Mate'), (2, 2, 1, 4, 3)]

## Métodos
* **clear()**. Este método remueve todos los elementos del diccionario.
* **copy()** . Este método devuelve una copia del diccionario
* **get()** . Este método devuelve el valor en base a una coincidencia de búsqueda en un diccionario mediante una clave, de lo contrario devuelve el objeto None
* **items()**. Este método devuelve una lista de pares de diccionarios (clave, valor), como 2 tuplas.
* **pop()**. Este método remueve específicamente una clave de diccionario y devuelve valor correspondiente
* **keys()**. Este método devuelve una lista de las claves del diccionario
* **values()**. Este método devuelve una lista de los valores del diccionario
* **update()**. Este método actualiza un diccionario agregando los pares clave-valores

## Problema 1

Escribe un programa que pase a mayúsculas la "clave" del siguiente diccionario  
dic={"hca":10,"eco":9,"cálculo":9,"redacción":8}

In [44]:
dic={"hca":10,"eco":9,"cálculo":9,"redacción":8}

In [59]:
a=[x.capitalize() for x in dic]
print(a)

['Hca', 'Eco', 'Cálculo', 'Redacción']

In [51]:
dic

{'hca': 10, 'eco': 9, 'cálculo': 9, 'redacción': 8}

Escribe un programa que multiplique por dos el valor del siguiente diccionario  
d7={"peras":12,"manzanas":35,"uvas":39,"platanos":12}

In [61]:
d7={"peras":12,"manzanas":35,"uvas":39,"platanos":12}

In [65]:
[x*2 for x in d7.values()]

[24, 70, 78, 24]

[24, 70, 78, 24]

[24, 70, 78, 24]

[24, 70, 78, 24]

[(12, 3.2, 12, 3.2), (35, 1, 35, 1), (39, 0, 39, 0), (12, 1.5, 12, 1.5)]

## Un ejercicio de matrices

Ana tiene el triple de edad que su hijo.  Dentro de 15 años, la edad de Ana será el doble de la de su hijo.
Cuántos años tiene Ana y su hijo?

a=3h

a+15=2(h+15)

In [34]:
import numpy as np

In [35]:
ecuaciones=np.mat('1 -3; 1 -2')
resultados=np.mat('0;15')

edades=ecuaciones.I*resultados
print('Ana tiene', edades[0],'años y su hijo tiene', edades[1])

Ana tiene [[45.]] años y su hijo tiene [[15.]]

En el salón de Santiago, hay un total de 27 alumnos, habiendo el doble de mujeres que de hombres.
Cuántos hombres hay en la clase de Santiago?

### m+h=27
### m=2h

In [36]:
matriz1= np.mat("1 1; 1 -2")
resultados= np.mat("27;0")
alumnos= matriz1.I*resultados

print("La cantidad de mujeres es de", alumnos[0], "y la de hombres es de", alumnos[1])

La cantidad de mujeres es de [[18.]] y la de hombres es de [[9.]]

In [37]:
# utilizando algebra lineal
alumnos2 = np.linalg.solve(matriz1, resultados)
print(int(alumnos2[0]), "mujeres")
print(int(alumnos2[1]), "hombres")

18 mujeres
9 hombres

### Retomando diccionarios

### Uso de pandas

In [67]:
import pandas as pd

In [68]:
from pandas import DataFrame

In [77]:
# Primeo voy a crear un diccionario
dicci = {'nombre':('Santiago','Xime','Sandy', 'Fernanda','Francisco','Luis'),
         'edad':(18,21,18,23,20,19),
         'carrera':('Eco','Finanzas','Actuaria','Eco','Eco','Finanzas')}

In [78]:
# muestra solo las llaves
dicci.keys()

dict_keys(['nombre', 'edad', 'carrera'])

In [79]:
# muestra solo los valores
dicci.values()

dict_values([('Santiago', 'Xime', 'Sandy', 'Fernanda', 'Francisco', 'Luis'), (18, 21, 18, 23, 20, 19), ('Eco', 'Finanzas', 'Actuaria', 'Eco', 'Eco', 'Finanzas')])

In [80]:
# muestra llaves y datos(informacion)
dicci.items()

dict_items([('nombre', ('Santiago', 'Xime', 'Sandy', 'Fernanda', 'Francisco', 'Luis')), ('edad', (18, 21, 18, 23, 20, 19)), ('carrera', ('Eco', 'Finanzas', 'Actuaria', 'Eco', 'Eco', 'Finanzas'))])

In [81]:
defi = pd.DataFrame(dicci)
defi

      nombre  edad   carrera
0   Santiago    18       Eco
1       Xime    21  Finanzas
2      Sandy    18  Actuaria
3   Fernanda    23       Eco
4  Francisco    20       Eco
5       Luis    19  Finanzas

In [45]:
defi[0:2]

     nombre  edad   carrera
0  Santiago    18       Eco
1      Xime    21  Finanzas

In [46]:
defi[5:2:-1]

      nombre  edad   carrera
5       Luis    19  Finanzas
4  Francisco    20       Eco
3   Fernanda    23       Eco

In [47]:
defi[::-1]

      nombre  edad   carrera
5       Luis    19  Finanzas
4  Francisco    20       Eco
3   Fernanda    23       Eco
2      Sandy    18  Actuaria
1       Xime    21  Finanzas
0   Santiago    18       Eco

In [74]:
import numpy as np

In [49]:
defi.min()

nombre     Fernanda
edad             18
carrera    Actuaria
dtype: object

In [50]:
defi.max()

nombre         Xime
edad             23
carrera    Finanzas
dtype: object

In [51]:
defi['edad'].min()

18

In [52]:
defi['nombre'].max()

'Xime'

In [53]:
defi.mean()

edad    19.833333
dtype: float64

In [54]:
defi['edad'].mean()

19.833333333333332

In [55]:
defi.describe()

            edad
count   6.000000
mean   19.833333
std     1.940790
min    18.000000
25%    18.250000
50%    19.500000
75%    20.750000
max    23.000000

In [56]:
defi.mean()

edad    19.833333
dtype: float64

# Lectura de archivos csv

In [57]:
dataf= pd.read_csv("datosEmpleo.csv", header=0)

In [58]:
dataf

,Name,Position,Office,Age,Start date,year,month,day,Salary
0,Airi Satou,Accountant,Tokyo,33,28/11/2008,2008,11,28,162700
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,09/10/2009,2009,10,9,1200000
2,Ashton Cox,Junior Technical Author,San Francisco,66,12/01/2009,2009,1,12,86000
3,Bradley Greer,Software Engineer,London,41,13/10/2012,2012,10,13,132000
4,Brenden Wagner,Software Engineer,San Francisco,28,07/06/2011,2011,6,7,206850
5,Brielle Williamson,Integration Specialist,New York,61,02/12/2012,2012,12,2,372000
6,Bruno Nash,Software Engineer,London,38,03/05/2011,2011,5,3,163500
7,Caesar Vance,Pre/Sales Support,New York,21,12/12/2011,2011,12,12,106450
8,Cara Stevens,Sales Assistant,New York,46,06/12/2011,2011,12,6,145600
9,Cedric Kelly,Senior Javascript Developer,Edinburgh,22,29/03/2012,2012,3,29,433060
10,Charde Marshall,Regional Director,San Francisco,36,16/10/2008,2008,10,16,470600
11,Colleen Hurst,Javascript Developer,San Francisco,39,15/09/2009,2009,9,15,205500
12,Dai Rios,Personnel Lead,Edinburgh,35,26/09/2012,2012,9,26,217500
13,Donna Snider,Customer Support,New York,27,25/01/2011,2011,1,25,112000
14,Doris Wilder,Sales Assistant,Sidney,23,20/09/2010,2010,9,20,85600
15,Finn Camacho,Support Engineer,San Francisco,47,07/07/2009,2009,7,7,87500
16,Fiona Green,Chief Operating Officer (COO),San Francisco,48,11/03/2010,2010,3,11,850000
17,Garrett Winters,Accountant,Tokyo,63,25/07/2011,2011,7,25,170750
18,Gavin Cortez,Team Leader,San Francisco,22,26/10/2008,2008,10,26,235500
19,Gavin Joyce,Developer,Edinburgh,42,22/12/2010,2010,12,22,92575
20,Gloria Little,Systems Administrator,New York,59,10/04/2009,2009,4,10,237500
21,Haley Kennedy,Senior Marketing Designer,London,43,18/12/2012,2012,12,18,313500
22,Hermione Butler,Regional Director,London,47,21/03/2011,2011,3,21,356250
23,Herrod Chandler,Sales Assistant,San Francisco,59,06/08/2012,2012,8,6,137500
24,Hope Fuentes,Secretary,San Francisco,41,12/02/2010,2010,2,12,109850
25,Howard Hatfield,Office Manager,San Francisco,51,16/12/2008,2008,12,16,164500
26,Jackson Bradshaw,Director,New York,65,26/09/2008,2008,9,26,645750
27,Jena Gaines,Office Manager,London,30,19/12/2008,2008,12,19,90560
28,Jenette Caldwell,Development Lead,New York,30,03/09/2011,2011,9,3,345000
29,Jennifer Acosta,Junior Javascript Developer,Edinburgh,43,01/02/2013,2013,2,1,75650
30,Jennifer Chang,Regional Director,Singapore,28,14/11/2010,2010,11,14,357650
31,Jonas Alexander,Developer,San Francisco,30,14/07/2010,2010,7,14,86500
32,Lael Greer,Systems Administrator,London,21,27/02/2009,2009,2,27,103500
33,Martena Mccray,Post/Sales support,Edinburgh,46,09/03/2011,2011,3,9,324050
34,Michael Bruce,Javascript Developer,Singapore,29,27/06/2011,2011,6,27,183000
35,Michael Silva,Marketing Designer,London,66,27/11/2012,2012,11,27,198500
36,Michelle House,Integration Specialist,Sidney,37,02/06/2011,2011,6,2,95400
37,Olivia Liang,Support Engineer,Singapore,64,03/02/2011,2011,2,3,234500
38,Paul Byrd,Chief Financial Officer (CFO),New York,64,09/06/2010,2010,6,9,725000
39,Prescott Bartlett,Technical Author,London,27,07/05/2011,2011,5,7,145000
40,Quinn Flynn,Support Lead,Edinburgh,22,03/03/2013,2013,3,3,342000
41,Rhona Davidson,Integration Specialist,Tokyo,55,14/10/2010,2010,10,14,327900
42,Sakura Yamamoto,Support Engineer,Tokyo,37,19/08/2009,2009,8,19,139575
43,Serge Baldwin,Data Coordinator,Singapore,64,09/04/2012,2012,4,9,138575
44,Shad Decker,Regional Director,Edinburgh,51,13/11/2008,2008,11,13,183000
45,Shou Itou,Regional Marketing,Tokyo,20,14/08/2011,2011,8,14,163000
46,Sonya Frost,Software Engineer,Edinburgh,23,13/12/2008,2008,12,13,103600
47,Suki Burks,Developer,London,53,22/10/2009,2009,10,22,114500
48,Tatyana Fitzpatrick,Regional Director,London,19,17/03/2010,2010,3,17,385750
49,Thor Walton,Developer,New York,61,11/08/2013,2013,8,11,98540
50,Tiger Nixon,System Architect,Edinburgh,61,25/04/2011,2011,4,25,320800
51,Timothy Mooney,Office Manager,London,37,11/12/2008,2008,12,11,136200
52,Unity Butler,Marketing Designer,San Francisco,47,09/12/2009,2009,12,9,85675
53,Vivian Harrell,Financial Controller,San Francisco,62,14/02/2009,2009,2,14,452500
54,Yuri Berry,Chief Marketing Officer (CMO),New York,40,25/06/2009,2009,6,25,675000
55,Zenaida Frank,Software Engineer,New York,63,04/01/2010,2010,1,4,125250
56,Zorita Serrano,Software Engineer,San Francisco,56,01/06/2012,2012,6,1,115000

In [59]:
dataf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57 entries, 0 to 56
Data columns (total 9 columns):
Name          57 non-null object
Position      57 non-null object
Office        57 non-null object
Age           57 non-null int64
Start date    57 non-null object
year          57 non-null int64
month         57 non-null int64
day           57 non-null int64
Salary        57 non-null int64
dtypes: int64(5), object(4)
memory usage: 4.1+ KB

In [82]:
defi.head()

      nombre  edad   carrera
0   Santiago    18       Eco
1       Xime    21  Finanzas
2      Sandy    18  Actuaria
3   Fernanda    23       Eco
4  Francisco    20       Eco

In [84]:
defi.describe()

            edad
count   6.000000
mean   19.833333
std     1.940790
min    18.000000
25%    18.250000
50%    19.500000
75%    20.750000
max    23.000000

In [87]:
defi.sort_values(by="edad",ascending=False)

      nombre  edad   carrera
3   Fernanda    23       Eco
1       Xime    21  Finanzas
4  Francisco    20       Eco
5       Luis    19  Finanzas
0   Santiago    18       Eco
2      Sandy    18  Actuaria